--
-- PostgreSQL database dump
--

-- Dumped from database version 14.18 (Ubuntu 14.18-0ubuntu0.22.04.1)
-- Dumped by pg_dump version 14.18 (Ubuntu 14.18-0ubuntu0.22.04.1)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- Name: bookings; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.bookings (
    id bigint NOT NULL,
    check_in_date timestamp(6) without time zone NOT NULL,
    check_out_date timestamp(6) without time zone NOT NULL,
    status character varying(255),
    room_id bigint NOT NULL,
    user_id bigint NOT NULL,
    payment_code bigint,
    pending_expires_at timestamp(6) without time zone,
    price double precision,
    authority character varying(255),
    ref_id bigint,
    CONSTRAINT bookings_status_check CHECK (((status)::text = ANY (ARRAY[('BOOKED'::character varying)::text, ('PENDING'::character varying)::text, ('AVAILABLE'::character varying)::text])))
);


ALTER TABLE public.bookings OWNER TO postgres;

--
-- Name: bookings_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.bookings_seq
    START WITH 1
    INCREMENT BY 50
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.bookings_seq OWNER TO postgres;

--
-- Name: hotels; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.hotels (
    id bigint NOT NULL,
    address character varying(255),
    city character varying(255),
    description text,
    name character varying(255),
    rate integer,
    stars integer,
    votes integer,
    features character varying(255)[],
    image_path character varying(255)
);


ALTER TABLE public.hotels OWNER TO postgres;

--
-- Name: hotels_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.hotels_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.hotels_id_seq OWNER TO postgres;

--
-- Name: hotels_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.hotels_id_seq OWNED BY public.hotels.id;


--
-- Name: hotels_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.hotels_seq
    START WITH 1
    INCREMENT BY 50
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.hotels_seq OWNER TO postgres;

--
-- Name: rooms; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.rooms (
    id bigint NOT NULL,
    hotel_id bigint,
    title character varying(255),
    capacity integer,
    price_per_night double precision
);


ALTER TABLE public.rooms OWNER TO postgres;

--
-- Name: rooms_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.rooms_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.rooms_id_seq OWNER TO postgres;

--
-- Name: rooms_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.rooms_id_seq OWNED BY public.rooms.id;


--
-- Name: rooms_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.rooms_seq
    START WITH 1
    INCREMENT BY 50
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.rooms_seq OWNER TO postgres;

--
-- Name: users; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.users (
    id bigint NOT NULL,
    email character varying(255),
    first_name character varying(255),
    last_name character varying(255),
    password character varying(255),
    phone_number character varying(255),
    role character varying(255),
    secret_key character varying(255),
    CONSTRAINT users_role_check CHECK (((role)::text = ANY (ARRAY[('USER'::character varying)::text, ('ADMIN'::character varying)::text])))
);


ALTER TABLE public.users OWNER TO postgres;

--
-- Name: users_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.users_seq
    START WITH 1
    INCREMENT BY 50
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER TABLE public.users_seq OWNER TO postgres;

--
-- Data for Name: bookings; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.bookings (id, check_in_date, check_out_date, status, room_id, user_id, payment_code, pending_expires_at, price, authority, ref_id) FROM stdin;
\.


--
-- Data for Name: hotels; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.hotels (id, address, city, description, name, rate, stars, votes, features, image_path) FROM stdin;
6	مشهد، خیابان امام رضا (ع)، میدان بسیج، بین امام رضا ۳۴ و ۳۶.	مشهد	هتل قصر طلایی مشهد که نزدیک حرم مطهر واقع شده، هتلی نوساز و مجلل در بین هتل‌های شهر مشهد است. هتل ۵ ستاره قصر طلایی مشهد بنایی ۱۶ طبقه دارد. اتاق دوتخته پاناروما و دوتخته پاناروما تراس دار مشرف به حرم هستند. این هتل با معماری منحصر به فرد، دارای ۳۵۸ اتاق،	هتل قصر طلایی (گلدن پالاس) مشهد	4	5	273	{"ترانسفر رایگان حرم","عکاسی رایگان","مجموعه آبی رایگان"}	6.jpg
5	مشهد، خیابان شیرازی، نبش شارستان رضوی، بین شیرازی ۲ و ۴.	مشهد	هتل مدینه الرضا مشهد در خیابان شیرازی و نزدیک به حرم امام رضا قرار گرفته است. هتل ۵ ستاره مدینه الرضا از سال ۱۳۹۲ با تعداد ۳۳۰ اتاق در ساختمانی ۱۲ طبقه به پذیرایی از زائران و مسافران شهر مقدس مشهد می‌پردازد و اکنون یکی از بهترین هتل‌های شهر مشهد شناخته می	هتل مدینه الرضا مشهد	4	5	275	{"استخر رایگان","نزدیک حرم","ترانسفر رایگان"}	5.jpg
7	تهران، خیابان طالقانی، تقاطع نجات اللهی، پلاک ۱۱۵.	تهران	هتل هویزه تهران در تقاطع خیابان طالقانی و خیابان نجات‌اللهی، خیابان‌های محبوب تهران، قرار گرفته است و هتلی باسابقه در بین هتل‌های شهر تهران به‌شمار می‌رود. هتل ۴ ستاره هویزه تهران در سال ۱۳۵۳ تاسیس شد و در سال ۱۳۹۳ تمامی ۱۵۰ اتاق و ساختمان ۱۵ طبقه‌ای خود را بازسازی کرد.اتاق‌های تمیز و مرتب هتل هویزه تهران اقامتی آرام و راحت را برای شما فراهم می‌کنند. کارکنان خوش‌روی هتل هم تلاش خود را به کار گرفته‌اند تا تجربه خوبی از سفر خود به شهر تهران داشته باشید. از دیگر امکانات هتل هویزه تهران می‌توان به سالن کنفرانس و اتاق جلسات، رستوران ایرانی، و کافی‌شاپ اشاره کرد. در سایت اسنپ‌تریپ می‌توانید امکانات و جزئیات اتاق‌های هتل هویزه تهران را مشاهده و برای سفر خود به تهران، آن را رزرو کنید.موقعیت مناسب و قرارگیری هتل هویزه تهران در خیابان ویلا، دسترسی شما به دیگر نقاط شهر تهران را امکان‌پذیر کرده است؛ با حدود ۱۲ دقیقه پیاده‌روی به ایستگاه مترو طالقانی و فردوسی می‌رسید. علاوه بر آن به فروشگاه‌های صنایع‌دستی و قنادی‌های خوب خیابان ویلا هم نزدیک هستید. رستوران شبستان و کافه لئون برای صرف غذا و نوشیدنی در خارج از هتل مناسب‌اند و برای بازدید از کاخ گلستان با خودرو ۲۰ دقیقه از هتل هویزه تهران راه دارید. خیابان انقلاب، خیابان ولیعصر، و خیابان کریم‌خان با کافه‌ها و کتاب‌فروشی‌های متنوع، مراکز درمانی، و مراکز ادارای مهم تهران در اطراف هتل هویزه تهران واقع شده‌اند.	هتل هویزه تهران	4	4	770	{"ورود زودهنگام","مینی بار رایگان","نزدیک حرم"}	7.jpg
11	تهران، سعادت آباد، میدان بهرود، خیابان عابدی، کوچه ۳۳	تهران	بعد از افتتاح هتل اسپیناس پالاس - کلکسیون لوکس گروه هتل های اسپیناس در سال ۹۴ در تهران، که بزرگ‌ترین هتل تهران هم لقب گرفت، خبرها حاکی از آن بود که یکی از لوکس‌ترین هتل‌های کشور فعالیتش را در پایتخت آغاز کرده. این هتل ۵ ستاره ۲۰ طبقه دارد و ۴۰۰ واحد اقامتی در این هتل لوکس هستند.هتل اسپیناس پالاس - کلکسیون لوکس گروه هتل های اسپیناس را روی تپه‌ای مرتفع در سعادت آباد ساخته‌اند. ارتفاع ساختمان هتل و قرار گرفتن روی این تپه باعث شده مهمانان این هتل نمایی منحصر به فرد از تهران را در مقابل خود ببینند. و یکی از ویژگی‌های خوب این هتل این است که چشم‌اندازی به چهار طرف دارد. امکانات و خدمات هتل اسپیناس پالاس در نوع خود بی‌نظیر است. از لابی بسیار بزرگ و شیکش که در بدو ورود توجه مهمانان را به خودش جلب می‌کند، تا امکاناتی مثل مرکز خرید، آرایشگاه، رستوران و فست فود، سالن تنیس، سالن ماساژ و ... که همگی در محوطه‌ی خود هتل هستند. رزرو هتل اسپیناس پالاس - کلکسیون لوکس گروه هتل های اسپیناس برای برگزاری مراسم رسمی هم گزینه‌ی مناسبی است چون ۱۲ سالن گردهمایی‌اش ظرفیتی بین ۵۰ تا ۱۲۰۰ نفر دارند. ۴۲ اتاق هم برای کار و قرارداد و اهداف اقتصادی در نظر گرفته شده.با اقامت در این هتل کیفیت و رفاه در ذهن شما تعریف تازه‌ای پیدا خواهد کرد.	هتل اسپیناس پالاس	2	5	317	{"ترانسفر رایگان","استخر رایگان","نزدیک حرم"}	11.jpg
8	تهران، چهارراه قدس، خیابان دربند، نبش خیابان احمدی زمانی، پلاک ۱.	تهران	هتل ویستریا تهران در منطقه خوش آب‌وهوای دربند و نزدیک میدان تجریش، رو به کوه‌های البرز، قرار گرفته است. این هتل را می‌توان از ساختمان بلند سفیدش شناخت. ساختمان هتل در ۲۱ طبقه بنا شده و در مجموع ۹۸ سوئیت و اتاق دارد. در این هتل ۵ ستاره که در سال ۱۳۹۸ شروع به کار کرده، همه جور امکاناتی از جمله مرکز خرید، کافه، و رستوران‌های متنوع تا فضای سبز پیدا می‌شود.اتاق‌ها و سوئیت‌ها هتل ویستریا در کمال زیبایی چیده و طراحی شده‌اند، پرسنل خوش‌رو و مهمان‌نواز مجموعه نیز تمام تلاش خود را به‌کار گرفته‌اند تا اقامتی به‌یادماندنی را تجربه کنید. برای صرف غذا، رستوران رویال که در طبقه همکف قرار دارد، غذاهای ایرانی و بین‌المللی را سرو می‌کند. چشم‌انداز شهر تهران در رستوران اسکای لانج و روف گاردن هتل ویستریا، با سرو غذاهای متنوع و گریل، هم منظره‌ای زیبا را رقم زده است. کافه هتل هم به خیابان دربند دید دارد و فضایی دنج را برای صرف یک نوشیدنی فراهم آورده. مجموعه ورزشی هتل ویستریا، خستگی یک روز گردش را در شهر شلوغی مثل تهران از تن شما بیرون می‌کند. مرکز سلامت هتل امکاناتی مانند سالن بدنسازی، حمام ترکی، استخر، سونا خشک و بخار، جکوزی، و ماساژ را در خود جای داده است.علاوه بر امکانات و خدمات ارائه شده در هتل، با اقامت در هتل ویستریا به اماکن تاریخی و دیدنی شمال تهران هم نزدیک هستید. دربند و مجموعه فرهنگی تا‌‌‌‌ریخی سعدآباد حدود ۵ دقیقه از شما فاصله دارند و با ۱۰ دقیقه پیاده‌روی به بازار تجریش، بازار قائم، و مرکز خرید تندیس دسترسی خواهید داشت. در اسنپ‌تریپ می‌توانید هتل ویستریا تهران با بهترین قیمت به صورت آنلاین رزرو کنید.	هتل ویستریا تهران	5	5	156	{"پارکنیگ رایگان","تفریحات رایگان","نزدیک حرم"}	8.jpg
2	مشهد، خیابان امام رضا، امام رضا ۲۰.	مشهد	هتل الماس ۲ مشهد، شعبه دوم هتل الماس و هتلی ۵ ستاره است که در بلوار امام رضا قرار دارد. هتل الماس ۲ که در سال ۱۳۹۶ با ۲۱۶ اتاق و سوئیت در ۲۵ طبقه تاسیس شد، نوساز و یکی از به‌روزترین هتل‌های شهر مشهد به‌شمار می‌رود. امکانات مدرن و مجهز هتل باعث شده تا هتل 	هتل الماس ۲ مشهد	3	5	376	{"عکاسی رایگان","نزدیک حرم"}	2.jpg
4	مشهد، خیابان امام رضا، بین امام رضا ۲۴ و ۲۶.	مشهد	هتل مجلل درویشی مشهد یکی از معروف‌ترین هتل های مشهد است که در سال ۱۳۹۰ افتتاح شد. هتل ۵ ستاره مجلل درویشی در اصلی‎‌ترین خیابان منتهی به حرم امام رضا و در فاصله‌ ۲ کیلومتری از حرم قرار دارد. این هتل با ۲۵ طبقه یکی از مرتفع‌ترین ساختمان‌های مشهد به‌شمار می‌	هتل مجلل درویشی مشهد	5	5	278	{"وعده غذایی رایگان"}	4.jpg
9	تهران، خیابان ولیعصر، بالاتر از میدان ولیعصر، نبش کوچه دانش کیان، پلاک ۱۷۵۲.	تهران	هتل آرامیس تهران چند قدم بالاتر از میدان ولیعصر و در قلب پایتخت قرار گرفته است. این هتل ۴ ستاره، هتل باسابقه‌ای‌ست که حدود ۵۰ سال از ساختش می‌گذرد و در ارائه بهترین خدمات تجربه دارد. ساختمان هتل آرامیس که در سال ۱۳۹۴ مورد بازسازی قرار گرفت ۱۳۳ اتاق و سوئیت در ۷ طبقه دارد. رستوران هتل انواع غذاهای ایرانی را برای مهمانان طبخ می‌کند و در کافه می‌توانید کمی استراحت کنید. از دیگر امکاناتش می‌توان به سالن کنفرانس، سالن ورزشی، و اتاق جلسات اشاره کرد.در زمان اقامت در هتل آرامیس تهران می‌توانید بعدازظهرها در بلندترین خیابان تهران قدم بزنید، از تماشای مغازه‌‌های متنوع و ویترین‌های رنگارنگ لذت ببرید، و درخت‌های معروف چنار را ببینید. در صورتی هم که خواستید بیرون از هتل برای صرف غذا بروید، غذاخوری‌های زیادی را در اطرافتان خواهید یافت. به‌غیر از مغازه‌های متنوع و رستوران‌ها، چند سینمای معروف پایتخت هم در نزدیکی هتل آرامیس قرار دارد که گزینه خوبی برای کمی تفریح و سرگرمی در بیرون از هتل است. در بسیاری از روزهای سال هم می‌توانید هتل آرامیس تهران را از اسنپ‌تریپ با بهترین قیمت و به صورت آنلاین برای سفرتان به تهران رزرو کنید.	هتل آرامیس تهران	1	4	304	{"کنسلی رایگان","نزدیک حرم"}	9.jpg
3	مشهد، خیابان امام رضا (ع)، بین امام رضا ۷ و ۹.	مشهد	هتل مدائن مشهد که در خیابان امام رضا و بین امام رضا ۷ و ۹ قرار گرفته، با ۲۰ سال سابقه یکی از شناخته‌ شده‌ترین هتل‌های شهر مشهد به‌شمار می‌رود. این هتل ۳ ستاره دارای ۱۶۵ اتاق در ۲ ساختمان، یکی ۵ طبقه و دیگری ۷ طبقه، است. هتل در سال ۱۳۶۵ تاسیس شد و در سال ۱	هتل مدائن مشهد	2	3	113	{"وعده غذایی رایگان","استخر رایگان","نزدیک حرم"}	3.jpg
10	تهران، بزرگراه شهید چمران، تقاطع یادگار امام	تهران	هتل پارسیان آزادی تهران با قدمتی که به پیش از انقلاب می‌رسد، یکی از هتل‌های محبوب در بین هتل‌های شهر تهران است. این هتل ۵ ستاره که در دهه ۷۰ میلادی ساخته شده است، به هتل هایت شناخته می‌شد. هتل پارسیان آزادی تهران ۴۷۵ اتاق و سوئیت دارد که خدمات و امکانات لوکسی را در یکی از مناطق خوش آب ‌و هوای تهران ارائه می‌کند.هتل طراحی زیبایی و مدرنی دارد و در زمان اقامتتان می‌توانید از رستوران‌های متنوع، کافی‌شاپ، فروشگاه‌ها، مجموعه ورزشی، استخر، ماساژ، سونا، و بیزینس سنتر استفاده کنید. از دیگر امکانات هتل پارسیان آزادی تهران هم می‌توان به سالن همایش و کنفرانس، تالار پذیرایی، اتاق جلسات، سالن اجتماعات، و خدمات CIP نام برد. در بسیاری از اتاق‌های هتل هم چشم‌انداز شهر یا کوه‌های شمال تهران را خواهید داشت.هتل به دلیل نزدیکی به اتوبان چمران دسترسی خوبی به مناطق مختلف شهر تهران دارد. در زمان اقامت در هتل پارسیان آزادی تهران به محله اوین و کوه‌های توچال هم نزدیک هستید که تهران را زیر پایتان خواهید یافت. در زمان سفر می‌توانید هتل پارسیان آزادی تهران را با بهترین قیمت از سایت اسنپ تریپ به صورت آنلاین رزرو کنید تا تجربه اقامتی خوب را در تهران داشته باشید.	هتل پارسیان آزادی تهران	5	5	695	{"مرکز شهر"}	10.jpg
1	مشهد، خیابان امام رضا، ما بین امام رضا چهارم و ششم.	مشهد	هتل الماس ۱ مشهد در خیابان امام رضا و نزدیک حرم قرار گرفته است. هتل ۴ ستاره الماس ۱ با تعداد ۱۶۳ اتاق و سوئیت در ۹ طبقه در سال ۱۳۹۲ تاسیس شد تا اقامت باکیفیت و خدمات رفاهی مناسبی را برای زائران و مسافران در میان هتل‌های شهر مشهد فراهم کند.با رزرو آنلاین ا	هتل الماس ۱ مشهد	1	4	339	{"عکاسی رایگان","سونا و جکوزی رایگان"}	1.jpg
\.


--
-- Data for Name: rooms; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.rooms (id, hotel_id, title, capacity, price_per_night) FROM stdin;
120	10	دو تخته برای یک نفر نرمال	1	8500000
37	2	سه تخته استاندارد پلاس	3	9025000
34	2	سه تخته اکونومی	3	7030000
32	2	دو تخته دابل استاندارد پلاس	2	6745000
35	2	سه تخته استاندارد	3	8265000
31	2	دو تخته دابل استاندارد	2	6745000
1	4	یک تخته یاقوت (اکونومی)	1	16256000
2	4	یک تخته الماس (استاندارد)	1	18012000
3	4	دو تخته دابل فیروزه (اکونومی)	2	21088000
4	4	دو تخته تویین یاقوت (اکونومی پلاس)	2	22844000
5	4	دو تخته دابل یاقوت (اکونومی پلاس)	2	22844000
6	4	دو تخته دابل الماس (استاندارد)	2	26360000
7	4	دو تخته تویین الماس (استاندارد)	2	26360000
8	4	دو تخته دابل برلیان	2	29872000
9	4	سه تخته یاقوت (اکونومی)	3	31632000
10	4	دو تخته دابل امپریال سبک هند	2	33000000
11	4	دو تخته دابل امپریال سبک روسیه	2	33000000
12	4	دو تخته دابل امپریال سبک آفریقا	2	33000000
13	4	دو تخته دابل امپریال سبک تایلند	2	33000000
14	4	سه تخته الماس (استاندارد)	3	34704000
15	4	سوئیت یک خوابه دو تخته	2	34760000
16	4	دو تخته دابل امپریال سبک عرب	2	36080000
17	4	دو تخته دابل امپریال سبک ایتالیا	2	36080000
18	4	دو تخته دابل امپریال سبک ترکیه	2	36080000
19	4	سوئیت دو تخته هانی مون	2	39600000
20	4	سوئیت دو تخته هانی مون رویال	2	41800000
21	4	سوئیت چهار تخته	4	44880000
22	4	کانکت چهار تخته یاقوت	4	49204000
23	4	سوئیت پرزیدنت سبک ترکیه	2	52800000
24	4	سوئیت پرزیدنت سبک صفویه	2	52800000
25	4	سوئیت پرزیدنت سبک ایران باستان	2	52800000
26	4	کانکت چهار تخته الماس	4	54476000
38	2	سه تخته اسپا	3	9025000
40	2	سوییت دو تخته استاندارد پلاس	2	9310000
36	2	سوئیت یک خوابه دو تخته استاندارد	2	8740000
39	2	دو تخته دابل کویین VIP	2	9025000
33	2	دو تخته تویین استاندارد پلاس	2	7030000
29	2	دو تخته تویین اکونومی	2	5985000
28	2	یک تخته استاندارد	1	4655000
27	2	یک تخته اکونومی	1	4275000
30	2	دو تخته تویین استاندارد	2	5985000
121	10	دو تخته تویین نرمال	2	9000000
122	10	دو تخته دابل نرمال	2	9000000
123	10	سوئیت دو تخته جونیور نرمال	2	17000000
103	7	دو تخته تویین	2	6710000
100	7	دو تخته برای یک نفر	1	6500000
102	7	دو تخته دابل	2	7381000
99	7	سه تخته رویال فمیلی	3	10120000
104	7	سه تخته	3	8778000
101	7	دو تخته دابل رویال	2	8030000
124	11	دو تخته تویین کلاسیک CF	2	10260000
125	11	دو تخته دابل استاندارد PF	2	11685000
126	11	دو تخته تویین کلاسیک CF رو به شهر	2	11685000
133	11	یک تخته EF	1	12826000
46	2	دوبلکس تاپ VIP (هند، عرب، چین)	4	12350000
42	2	چهارتخته اکونومی	4	11305000
47	2	دوبلکس تاپ VIP ویژه (مصر، ایران باستان، ایران اسلام)	4	22325000
45	2	سه تخته امپریال VIP	3	12065000
44	2	چهار تخته استاندارد پلاس	4	11780000
41	2	سوئیت یک خوابه دو تخته امپریال VIP	2	9310000
43	2	چهار تخته استاندارد	4	11495000
81	3	یک تخته	1	3100000
82	3	دو تخته	2	4000000
83	3	سه تخته	3	6000000
65	5	یک تخته	1	3480000
48	6	یک تخته اکونومی	1	4280430
49	6	یک تخته لاکچری	1	5092000
50	6	دو تخته دابل آتریوم	2	5966000
51	6	دو تخته دابل لاکچری	2	7020000
52	6	سوئیت دو تخته جونیور	2	8075000
53	6	سوئیت دو تخته وسترن	2	8075000
54	6	دو تخته دابل لاکچری تراس دار	2	8778000
55	6	سوئیت دو تخته پرنسس	2	8778000
56	6	دو تخته دابل پاناروما	2	8778000
57	6	سوئیت یک خوابه دو تخته سنیور	2	10184000
58	6	سوئیت دو تخته پرنسس رویال	2	10184000
59	6	دو تخته دابل پاناروما تراس دار	2	10184000
60	6	کانکت چهار تخته	4	14041000
61	6	آپارتمان یک خوابه چهار تخته رویال	4	17556000
62	6	سوئیت یک خوابه چهار تخته قاجاری	4	17556000
63	6	سوئیت یک خوابه چهار تخته امپریال	4	18259000
64	6	سوئیت دو خوابه چهار تخته پرزیدنت	4	20358000
66	5	یک تخته همراه با صبحانه و ناهار و شام (منو بوفه)	1	3950000
67	5	دو تخته دابل	2	4350000
68	5	دو تخته تویین	2	4350000
69	5	دو تخته دابل همراه با صبحانه و ناهار و شام (منو بوفه)	2	5300000
70	5	دو تخته تویین همراه با صبحانه و ناهار و شام (منو بوفه)	2	5300000
71	5	سه تخته	3	6050000
72	5	چهار تخته	4	7750000
73	5	سه تخته همراه با صبحانه و ناهار و شام (منو بوفه)	3	7950000
74	5	سوئیت یک خوابه چهار تخته	4	8100000
75	5	کانکت چهار تخته	4	8700000
76	5	کانکت پنج تخته	5	10400000
77	5	چهار تخته همراه با صبحانه و ناهار و شام (منو بوفه)	4	10600000
78	5	کانکت چهار تخته همراه با صبحانه و ناهار و شام (منو بوفه)	4	10600000
79	5	سوئیت یک خوابه چهار تخته همراه با صبحانه و ناهار و شام (منو بوفه)	4	10600000
80	5	کانکت پنج تخته همراه با صبحانه و ناهار و شام (منو بوفه)	5	13250000
105	8	دو تخته دابل استاندارد	2	7392000
106	8	دو تخته تویین استاندارد	2	7392000
107	8	دو تخته دابل ویژه	2	8360000
108	8	دو تخته تویین ویژه	2	8360000
109	8	دو تخته تویین کینگ	2	9328000
110	8	دو تخته تویین کینگ بالکن دار	2	10296000
111	8	دو تخته دابل کینگ	2	10296000
112	8	سه تخته کینگ	3	11264000
113	8	سوئیت دو تخته پرزیدنتال	2	15675000
114	8	سوئیت دو تخته ویستریا	2	19965000
84	3	چهار تخته	4	8000000
115	9	دو تخته برای یک نفر	1	5500000
116	9	دو تخته تویین	2	5600000
117	9	دو تخته دابل	2	5600000
118	9	سه تخته	3	7480000
119	9	سوئیت یک خوابه سه تخته جونیور	3	7920000
85	1	دو تخته دابل اکونومی	2	5525000
86	1	دو تخته اکونومی (پنجره رو به لابی)	2	5797000
87	1	دو تخته تویین اکونومی (پنجره رو به لابی)	2	5797000
88	1	دو تخته دابل فصل	2	6820000
89	1	دو تخته تویین فصل	2	6820000
90	1	سه تخته اکونومی (پنجره رو به لابی)	3	7843000
91	1	دو تخته دابل لوکس فصل	2	8184000
92	1	سه تخته فصل ( تخت سینگل )	3	8866000
93	1	سه تخته فصل	3	8866000
94	1	سوئیت یک خوابه دو تخته	2	10230000
95	1	کانکت سه تخته استاندارد	3	11457600
96	1	آپارتمان یک خوابه دو تخته فصل	2	11880000
97	1	کانکت چهار تخته استاندارد	4	13640000
98	1	کانکت پنج تخته استاندارد	5	14600000
127	11	یک تخته استاندارد PF	1	11685000
128	11	دو تخته دابل استاندارد کلاسیک رو به شهر CF	2	11685000
129	11	دو تخته تویین استاندارد PF	2	11685000
130	11	دو تخته تویین PF رو به شهر	2	12351000
131	11	دو تخته دابل استاندارد PF رو به شهر	2	12351000
132	11	دو تخته تویین استاندارد EF	2	12826000
134	11	دو تخته استاندارد گاردن بالکنی CF	2	12826000
135	11	دو تخته دابل استاندارد EF رو به شهر	2	13586000
136	11	دو تخته تویین استاندارد EF رو به شهر	2	13586000
137	11	سه تخته استاندارد CF رو به شهر (سینگل)	3	14251000
138	11	سه تخته استاندارد CF رو به شهر	3	14251000
139	11	سه تخته خانوادگی رویال CF	3	14916000
140	11	سه تخته استاندارد PF رو به شهر (سینگل)	3	14916000
141	11	سه تخته استاندارد رو به شهر PF	3	14916000
142	11	دو تخته بالکن دار رویال خانوادگی CF	2	16911000
143	11	سه تخته رویال خانوادگی PF	3	16911000
144	11	سه تخته استاندارد رو به شهر EF	3	16911000
145	11	دو تخته بالکن دار رویال خانوادگی PF	2	18241000
146	11	سه تخته خانوادگی رویال EF	3	19571000
147	11	سوئیت سه تخته جونیور CF	3	19571000
148	11	سوئیت سه تخته جونیور CF رو به شهر	3	21376000
149	11	سوئیت سه تخته جونیور PF	3	21566000
150	11	سوئیت سه تخته جونیور PF رو به شهر	3	23656000
151	11	سوئیت سه تخته جونیور EF	3	23656000
152	11	سوئیت دو تخته جونیور CR7	2	36577000
153	11	سوئیت دو تخته رویال EF	2	41232000
154	11	سوئیت دو تخته اسکای	2	71633000
\.


--
-- Data for Name: users; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.users (id, email, first_name, last_name, password, phone_number, role, secret_key) FROM stdin;
\.


--
-- Name: bookings_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.bookings_seq', 501, true);


--
-- Name: hotels_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.hotels_id_seq', 5, true);


--
-- Name: hotels_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.hotels_seq', 1, false);


--
-- Name: rooms_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.rooms_id_seq', 154, true);


--
-- Name: rooms_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.rooms_seq', 1, false);


--
-- Name: users_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.users_seq', 551, true);


--
-- Name: bookings bookings_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.bookings
    ADD CONSTRAINT bookings_pkey PRIMARY KEY (id);


--
-- Name: users constraint_email; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.users
    ADD CONSTRAINT constraint_email UNIQUE (email);


--
-- Name: hotels hotels_pk; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.hotels
    ADD CONSTRAINT hotels_pk PRIMARY KEY (id);


--
-- Name: rooms rooms_pk; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.rooms
    ADD CONSTRAINT rooms_pk PRIMARY KEY (id);


--
-- Name: users users_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.users
    ADD CONSTRAINT users_pkey PRIMARY KEY (id);


--
-- Name: bookings bookings_rooms_id_fk; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.bookings
    ADD CONSTRAINT bookings_rooms_id_fk FOREIGN KEY (room_id) REFERENCES public.rooms(id);


--
-- Name: bookings fkeyog2oic85xg7hsu2je2lx3s6; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.bookings
    ADD CONSTRAINT fkeyog2oic85xg7hsu2je2lx3s6 FOREIGN KEY (user_id) REFERENCES public.users(id);


--
-- Name: rooms rooms_hotels_id_fk; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.rooms
    ADD CONSTRAINT rooms_hotels_id_fk FOREIGN KEY (hotel_id) REFERENCES public.hotels(id);


--
-- PostgreSQL database dump complete
--

